Autodesk.Revit.DB.IFC.ExporterIFC.GetWallFunctionMappingTable
Get the table that contains a mapping from Revit Wall functions to IFC entities.
Remarks:
This table is calculated every time this function is called.
Returns:
The mapping table.
Since:
2025

Autodesk.Revit.DB.IFC.ExporterIFC.GetCategoryMappingTable
Get the table that contains a mapping from Revit categories to IFC entities.
Remarks:
This table is calculated every time this function is called.
Returns:
The mapping table.
Since:
2025